.. _banknote_userguide:

Euro Banknote Serial Numbers
============================

Introduction
------------

The function :func:`clean_eu_banknote() <dataprep.clean.clean_eu_banknote.clean_eu_banknote>` cleans a column containing Euro banknote serial number strings, and standardizes them in a given format. The function :func:`validate_eu_banknote() <dataprep.clean.clean_eu_banknote.validate_eu_banknote>` validates either a single Euro banknote strings, a column of Euro banknote strings or a DataFrame of Euro banknote strings, returning `True` if the value is valid, and `False` otherwise.

Euro banknote strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "P36007033744"
* `standard`: Euro banknote strings with proper whitespace in the proper places. Note that in the case of Euro banknote, the compact format is the same as the standard one.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_eu_banknote()` and `validate_eu_banknote()`.

### An example dataset containing Euro banknote strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "banknote": [
            'P36007033744',
            'P36007033743',
            'BE 428759497',
            'BE431150351',
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

       banknote                                           address
0  P36007033744                                     123 Pine Ave.
1  P36007033743                                           main st
2  BE 428759497                      1234 west main heights 57033
3   BE431150351                    apt 1 789 s maple rd manhattan
4   002 724 334                robie house, 789 north main street
5         hello         1111 S Figueroa St, Los Angeles, CA 90015
6           NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NULL                                             hello

## 1. Default `clean_eu_banknote`

By default, `clean_eu_banknote` will clean banknote strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_eu_banknote
clean_eu_banknote(df, column = "banknote")

,banknote,address,banknote_clean
0,P36007033744,123 Pine Ave.,P36007033744
1,P36007033743,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_eu_banknote(df, column = "banknote", output_format="standard")

,banknote,address,banknote_clean
0,P36007033744,123 Pine Ave.,P36007033744
1,P36007033743,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_eu_banknote(df, column = "banknote", output_format="compact")

,banknote,address,banknote_clean
0,P36007033744,123 Pine Ave.,P36007033744
1,P36007033743,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned Euro banknote strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_eu_banknote(df, column="banknote", inplace=True)

  banknote_clean                                           address
0   P36007033744                                     123 Pine Ave.
1            NaN                                           main st
2            NaN                      1234 west main heights 57033
3            NaN                    apt 1 789 s maple rd manhattan
4            NaN                robie house, 789 north main street
5            NaN         1111 S Figueroa St, Los Angeles, CA 90015
6            NaN  (staples center) 1111 S Figueroa St, Los Angeles
7            NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_eu_banknote(df, "banknote", errors="coerce")

,banknote,address,banknote_clean
0,P36007033744,123 Pine Ave.,P36007033744
1,P36007033743,main st,NaN
2,BE 428759497,1234 west main heights 57033,NaN
3,BE431150351,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [7]:
clean_eu_banknote(df, "banknote", errors="ignore")

,banknote,address,banknote_clean
0,P36007033744,123 Pine Ave.,P36007033744
1,P36007033743,main st,P36007033743
2,BE 428759497,1234 west main heights 57033,BE 428759497
3,BE431150351,apt 1 789 s maple rd manhattan,BE431150351
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_eu_banknote()`

`validate_eu_banknote()` returns `True` when the input is a valid Euro banknote. Otherwise it returns `False`.

The input of `validate_eu_banknote()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_eu_banknote()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_eu_banknote()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_eu_banknote
print(validate_eu_banknote("P36007033744"))
print(validate_eu_banknote("P36007033743"))
print(validate_eu_banknote('BE 428759497'))
print(validate_eu_banknote('BE431150351'))
print(validate_eu_banknote("004085616"))
print(validate_eu_banknote("hello"))
print(validate_eu_banknote(np.nan))
print(validate_eu_banknote("NULL"))

True
False
False
False
False
False
False
False

### Series

In [9]:
validate_eu_banknote(df["banknote"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: banknote, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_eu_banknote(df, column="banknote")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: banknote, dtype: bool

### Only DataFrame

In [11]:
validate_eu_banknote(df)

   banknote  address
0      True    False
1     False    False
2     False    False
3     False    False
4     False    False
5     False    False
6     False    False
7     False    False